In [2]:
import pandas as pd

In [20]:
# Set some initial configuration 
pd.set_option("display.precision", 3)

In [33]:
# creating a DataFrame 
df = pd.DataFrame({'Name' : ['Simon', 'Marsh', 'Gaurav','Alex', 'Selena'],   
        'Maths' : [8, 5, 6, 9, 7],   
        'Science' : [7, 9, 5, 4, 7],  
        'English' : [7, 4, 7, 6, 8]})

In [34]:
df.dtypes

Name       object
Maths       int64
Science     int64
English     int64
dtype: object

In [35]:
df

     Name  Maths  Science  English
0   Simon      8        7        7
1   Marsh      5        9        4
2  Gaurav      6        5        7
3    Alex      9        4        6
4  Selena      7        7        8

In [ ]:
## Read a dataframe
my_df = pd.read_csv('example.csv', where col('hits') > 20)

In [ ]:
#skip even data rows


df_odd = pd.read_csv(
    'data_deposits.csv', 
    sep = ',', 
    skiprows = lambda x: x % 2 != 0
)
print( df_odd.head(10))

In [ ]:
read_csv(..., nrows=999999)

In [ ]:
read_csv(..., skiprows=1000000, nrows=999999)

In [25]:
df = pd.DataFrame({'A': [11, 21, 31],
                   'B': [12, 22, 32],
                   'C': [13, 23, 33]},
                  index=['ONE', 'TWO', 'THREE'])

print(df)
#         A   B   C
# ONE    11  12  13
# TWO    21  22  23
# THREE  31  32  33

        A   B   C
ONE    11  12  13
TWO    21  22  23
THREE  31  32  33

In [ ]:
df_new = df.rename(columns={'A': 'a'}, index={'ONE': 'one'})
print(df_new)

### str.split() with expand=True option results in a data frame

In [3]:
## str.split() with expand=True option results in a data frame 
## and without that we will get Pandas Series object as output.import Pandas as pd

# create a new data frame
df = pd.DataFrame({'Name': ['Steve Smith', 'Joe Nadal',
                            'Roger Federer','Juanita', 'Esteban'],
                 'Age':[32, 34, 36,85,44],
                 'Peso':[100,150,140,30,90],
                 'Masa':[95,54,0,0,0]})
df

            Name  Age  Peso  Masa
0    Steve Smith   32   100    95
1      Joe Nadal   34   150    54
2  Roger Federer   36   140     0
3        Juanita   85    30     0
4        Esteban   44    90     0

In [4]:
# dropping null value columns to avoid errors 
df.dropna(inplace = True)

In [5]:
new = df["Name"].str.split(" ", n = 1, expand = True)

In [6]:
new

         0        1
0    Steve    Smith
1      Joe    Nadal
2    Roger  Federer
3  Juanita     None
4  Esteban     None

In [7]:
# making separate first name column from new data frame 
df["First Name"]= new[0]
df

            Name  Age  Peso  Masa First Name
0    Steve Smith   32   100    95      Steve
1      Joe Nadal   34   150    54        Joe
2  Roger Federer   36   140     0      Roger
3        Juanita   85    30     0    Juanita
4        Esteban   44    90     0    Esteban

In [8]:
df["Last Name"]= new[1]
df

            Name  Age  Peso  Masa First Name Last Name
0    Steve Smith   32   100    95      Steve     Smith
1      Joe Nadal   34   150    54        Joe     Nadal
2  Roger Federer   36   140     0      Roger   Federer
3        Juanita   85    30     0    Juanita      None
4        Esteban   44    90     0    Esteban      None

In [9]:
# Dropping old Name columns 
df.drop(columns =["Name"], inplace = True) 
df

   Age  Peso  Masa First Name Last Name
0   32   100    95      Steve     Smith
1   34   150    54        Joe     Nadal
2   36   140     0      Roger   Federer
3   85    30     0    Juanita      None
4   44    90     0    Esteban      None

### Aply a function over the data

In [19]:
# Log2
for column in df.columns:
    try:
        df[column] = np.log10(df[column])
    except (ValueError, AttributeError):
        pass

NameError: name 'np' is not defined

### Group by and some functions()

In [16]:
dtypes = {
    "first_name": "category",
    "gender": "category",
    "type": "category",
    "state": "category",
    "party": "category",
}
df = pd.read_csv(
    "groupby-data/legislators-historical.csv",
    dtype=dtypes,
    usecols=list(dtypes) + ["birthday", "last_name"],
    parse_dates=["birthday"]
)

FileNotFoundError: [Errno 2] File groupby-data/legislators-historical.csv does not exist: 'groupby-data/legislators-historical.csv'

**SELECT state, count(name)
FROM df
GROUP BY state
ORDER BY state;**

In [ ]:
n_by_state = df.groupby("state")["last_name"].count()
n_by_state.head(10)

### Send a column to a list

In [ ]:
fruit_name_list = df["fruit"].tolist()

print(fruit_name_list)